Checks if Structural Connection Handler has the detailed connection style.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2017
 Syntax
  C#
public bool IsDetailed()
  Visual Basic
Public Function IsDetailed As Boolean
  Visual C++
public:
bool IsDetailed()
 Return Value
 True if Structural Connection Handler has the detailed connection style.
 See Also
  StructuralConnectionHandler Class
  Autodesk.Revit.DB.Structure Namespace